Revit 2027 API
BendingDetailCustomFieldProperties.RepresentaionOf3DShapes Property
 Identifies how the Bending Detail will represent the 3D shapes.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailFor3DShapesOptions RepresentaionOf3DShapes { get; set; }
Public Property RepresentaionOf3DShapes As BendingDetailFor3DShapesOptions
	Get
	Set
public:
property BendingDetailFor3DShapesOptions RepresentaionOf3DShapes {
	BendingDetailFor3DShapesOptions get ();
	void set (BendingDetailFor3DShapesOptions value);
}
member RepresentaionOf3DShapes : BendingDetailFor3DShapesOptions with get, set
Property Value
BendingDetailFor3DShapesOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace